Revit 2027 API
DocumentPrintedEventArgs.GetPrintedViewElementIds Method
 Returns ElementIds of the views that printed successfully.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetPrintedViewElementIds()
Public Function GetPrintedViewElementIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetPrintedViewElementIds()
member GetPrintedViewElementIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 ElementIds of the views that printed successfully.
See Also
Reference
DocumentPrintedEventArgs Class
Autodesk.Revit.DB.Events Namespace